app/Exports/OrdersExportEn.php

select * from `statuses` where `statuses`.`id` = 3 limit 1
---
 public function map($order): array
 {
     // TODO: Implement map() method.
     return [
         $order->id,
         $order->product_name,
         $order->value,
         $order->cust_name,
         $order->cust_num,
         $order->address,
         $order->state,
         $order->quantity,
         $order->notes,
         $order->status,
        $order->created_at,
     ];