app/Http/Livewire/Admin/OrderCreate.php

select * from `plans` where `plans`.`id` in (1)
---
    public function mount()
    {
        $this->packing_type = Packing::all();
        $this->basicId = Plan::first()->id;
        $this->systemLimit = sys('package_weight_limit');
        $this->user = auth()->user();
        $this->user_id = $this->user->id ;
        $this->types = ['cosmetics','clothes','document','furniture','machines','other'];
        $this->areas = Area::where('active',1)->whereHas('state',fn($q)=>$q->where('active','1'))->select('id','name')->orderBy('id','desc')->get();
        $this->sellers = User::with('plan')->whereHas("roles", function($q){ $q->where("name" ,'seller'); })->get();

select `id`, `delivery_cost`, `over_weight_cost` from `areas` where `id` = '14' limit 1
---
    public function go()
    {
        if ($this->value && $this->quantity){ // if there is value and quantity
            if($this->area_id && $this->package_weight ){
                $orderArea = Area::where('id', $this->area_id)->select('id','delivery_cost','over_weight_cost')->first();