app/Http/Livewire/Admin/OrdersTable.php

    public function render()
    {
        return view('livewire.admin.orders-table', [
            'orders' => Order::search($this->search)
                ->whereDate('created_at','>=',$this->startDate)
                ->WhereDate('created_at','<=',$this->endDate)
                ->with('user','area','status','state')
                ->orderBy($this->orderBy, $this->orderDesc ? 'desc' : 'asc')
                ->paginate($this->perPage)
        ]);
---
select * from `areas` where `areas`.`id` in (10, 11, 16, 17, 20, 22, 23, 25)
select * from `orders` where date(`created_at`) >= '2020-10-14' and date(`created_at`) <= '2021-10-14' and `orders`.`deleted_at` is null order by `id` desc limit 10 offset 0
select * from `statuses` where `statuses`.`id` in (1, 2, 3, 5, 6, 9)
select * from `users` where `users`.`id` in (4)