app/Http/Livewire/Admin/UsersTable.php

    public function render()
    {
        return view('livewire.admin.users-table', [
            'users' => User::search($this->search)
                ->with('roles','state','branch')
                ->whereHas("roles", function($q){ $q->whereNotIn("name", ["seller"]); })
                ->orderBy($this->orderBy, $this->orderAsc ? 'asc' : 'desc')
                ->simplePaginate($this->perPage),
        ]);
---
select * from `branches` where `branches`.`id` in (1, 2, 4, 6, 7, 8, 9)
select * from `states` where `states`.`id` in (1, 4, 14, 17, 23, 24, 25)