app/Http/Livewire/UserToggle.php

select * from `users` where `id` = '1' limit 1
update `users` set `active` = 0, `users`.`updated_at` = '2021-10-14 16:33:02' where `id` = 1
---
    public function toggle()
    {
        $user = User::where('id',$this->sid )->first();

        $user->active = !$user->active;
        $this->active = !$this->active;
        $user->update();