<?php

return [
    /*
    |--------------------------------------------------------------------------
    | الفاتورة
    |--------------------------------------------------------------------------
    */


    'invoice'                => 'فاتورة',
    'serial'                 => 'رقم تسلسلي',
    'date'                   => 'تاريخ',
    'seller'                 => 'البائع',
    'buyer'                  => 'المشتري',
    'address'                => 'العنوان',
    'code'                   => 'كود',
    'vat'                    => 'رقم ضريبي',
    'phone'                  => 'رقم الهاتف',
    'description'            => 'الوصف',
    'units'                  => 'الوحدات',
    'quantity'               => 'الكمية',
    'price'                  => 'السعر',
    'discount'               => 'الخصم',
    'tax'                    => 'الضريبة',
    'sub_total'              => 'الإجمالي قبل الخصم',
    'total_discount'         => 'إجمالي الخصم',
    'taxable_amount'         => 'المطبق عليه الضريبة',
    'total_taxes'            => 'إجمالي الضربية',
    'tax_rate'               => 'نسبة الضريبة',
    'total_amount'           => 'الإجمالي',
    'pay_until'              => 'يتم السداد قبل',
    'amount_in_words'        => 'الاجمالي باكلمات',
    'amount_in_words_format' => '%s %s and %s %s',
    'notes'                  => 'ملاحظات',
    'shipping'               => 'الشحن',
    'paid'                   => 'مدفوع',
    'due'                    => 'إلى',
];
