app/Http/Livewire/Seller/OrdersTable.php

select * from `areas` where `areas`.`id` in (3, 6, 9, 13, 18)
select * from `orders` where `user_id` = 1 and date(`created_at`) >= '2020-10-14' and date(`created_at`) <= '2021-10-14' and `orders`.`deleted_at` is null order by `id` desc limit 10 offset 0
select * from `statuses` where `statuses`.`id` in (1, 3, 5, 6, 10)
select count(*) as aggregate from `orders` where `user_id` = 1 and date(`created_at`) >= '2020-10-14' and date(`created_at`) <= '2021-10-14' and `orders`.`deleted_at` is null
---
    public function render()
    {
        $this->user_id =  auth()->user()->id;

        return view('livewire.seller.orders-table', [
            'orders' => Order::searchSeller($this->search,$this->user_id )
                ->where('user_id', $this->user_id )
                ->whereDate('created_at','>=',$this->startDate)
                ->WhereDate('created_at','<=',$this->endDate)
                ->with('area','status','state')
                ->orderBy($this->orderBy, $this->orderDesc ? 'desc' : 'asc')
                ->paginate($this->perPage)
        ]);

select `id` from `orders` where `user_id` = 1 and date(`created_at`) >= '2020-10-14' and date(`created_at`) <= '2021-10-14' and `orders`.`deleted_at` is null order by `id` desc
---
    public function export()
    {
        $orders = Order::searchSeller($this->search,$this->user_id )
            ->where('user_id', $this->user_id )
            ->whereDate('created_at','>=',$this->startDate)
            ->WhereDate('created_at','<=',$this->endDate)
            ->with('area','status','state')
            ->orderBy($this->orderBy, $this->orderDesc ? 'desc' : 'asc')
            ->pluck('id');