app/Providers/AuthServiceProvider.php

select * from `plans` where `plans`.`id` = 1 limit 1
select `features`.*, `feature_plan`.`plan_id` as `pivot_plan_id`, `feature_plan`.`feature_id` as `pivot_feature_id` from `features` inner join `feature_plan` on `features`.`id` = `feature_plan`.`feature_id` where `feature_plan`.`plan_id` = 1
select * from `features` where `name` = 'trash' limit 1
---
    public function boot()
    {
        $this->registerPolicies();

        // Implicitly grant "feedback" role all permission checks using can()
        Gate::before(function ($user, $ability) {
            if ($user->hasRole('Feedback')) {
                return true;
            }
        });
        Gate::define('feature', function (User $user,  $feature) {
            $feat =Feature::where('name',$feature)->first();
            return $user->plan->features->contains($feat->id?? 0);
        });