app/Http/Controllers/Admin/AreaController.php

select * from `zones` order by `rank` asc
select * from `areas` order by `id` desc limit 10 offset 20
select * from `zones` where `zones`.`id` in (1, 2, 3, 6, 7)
select count(*) as aggregate from `areas`
---
    public function index()
    {
        //
        $zones = Zone::orderBy('rank')->get();

        $areas = Area::with('zone','state')->orderBy('id','DESC')->paginate(10);