app/Http/Controllers/Admin/BranchController.php

select `id`, `name` from `locations` where `locations`.`id` in (3, 4, 5, 9, 10)
select `id`, `name` from `states` where `states`.`id` in (4, 5, 7, 14, 19, 20)
select count(*) as aggregate from `branches`
select * from `branches` order by `id` desc limit 10 offset 0
---
    public function index(Request $request)
    {
        //
        $branches = Branch::with(['manager'=> function($query) {
        $query->select('id','name');
            },'state'=> fn($q) => $q->select('id','name'),'location'=> fn($q) => $q->select('id','name')])
            ->orderBy('id','DESC')
            ->paginate(10);
//dd($branches);
        return view('admin.areas.branches.index',compact('branches'))->with('i',($request->input('page',1)-1)*10);