app/Http/Controllers/Admin/DashboardController.php

    public function profile()
    {
        $user = Auth::user();

        $total =  $user->orders()->whereNotIn('status_id', [1,2,10] )->sum('total');
---
select * from `orders` where `orders`.`user_id` = 1 and `orders`.`user_id` is not null and `orders`.`deleted_at` is null