app/Http/Controllers/Admin/DashboardController.php

select * from `profiles` where `profiles`.`user_id` = 1 and `profiles`.`user_id` is not null limit 1
---
    public function profileUpdate(Request $request)
    {
        //  dd($request->all());
        $user = Auth::user();

        $this->validate($request,[
            'name'=>'required',
            'bio'=> '',
            'email'=>'required|email',
            'phone'=>'required|numeric',
            'address'=> '',
            'area'=> '',
            'state'=> 'required',
            'profile_photo'=> 'image',
            'url'=> '',
        ]);

        $input = $request->all();

        $path = 'uploads/profiles/photos';
        if(!File::isDirectory($path)){
            File::makeDirectory($path, 0777, true, true);
        }

        if(! isset($input['profile_photo'])){
            $photoPath  = $user->profile->photo;
        }else {
            if(File::exists(storage_path().'/app/public/'.$user->profile->profile_photo)){

select * from `areas` where `areas`.`id` in (1, 2, 4, 6, 8, 9, 10, 15, 16, 17, 18, 19, 22, 23, 24)
select * from `orders` where exists (select * from `statuses` where `orders`.`status_id` = `statuses`.`id` and `id` = 2) and `orders`.`deleted_at` is null
---
    public function assign(){
        $orders = Order::with('area')->whereHas("status", function($q){ $q->where("id" ,2); })->get();

update `settings` set `footer` = 'all right reversed', `settings`.`updated_at` = '2021-10-13 23:26:20' where `id` = 1
---
    public function saveSetting(Request $request)
    {
        $this->validate($request,[
           'app_name'=>'nullable',
           'title'=>'nullable',
           'slogan'=>'nullable',
           'footer'=>'nullable',
            'owner'=>'nullable',
            'email'=>'nullable|email',
            'theme'=>'nullable',
            'auto_send'=>'nullable|boolean',
            'reschedule_limit' => 'required',
            'package_weight_limit' => 'required',
        ]);

       $input = $request->all();

     //  dd($input);
       if(!isset($input['auto_send'])){
           $input['auto_send'] = false;
       }else{
           $input['auto_send'] = true;
       }
        Config::set(['app.name' => $input['app_name']]);
        $setting = Setting::first();
       if ($setting){
           $setting->update($input);

select count(*) as aggregate from `orders` where `orders`.`deleted_at` is not null
select count(*) as aggregate from `tasks` where `tasks`.`deleted_at` is not null
---
    public function trash()
    {
            //   dd('else');
            //    $orders = auth()->user()->orders()->orderBy('updated_at','DESC')->paginate(10);
            $deletedOrders = Order::onlyTrashed()->count();
            $deletedTasks = Task::onlyTrashed()->count();