app/Http/Controllers/Admin/DashboardController.php

        if(!$setting){
            Setting::create($input) ;
        }else{
            $setting->update($input);
---
update `settings` set `company_logo` = 'uploads/setting/logo/hLkhWc3AAusMKH4Ecv64938PzR4Y9oI9B0CbeNRN.png', `settings`.`updated_at` = '2021-10-17 18:17:52' where `id` = 1