app/Http/Controllers/Admin/OrdersController.php

    public function restore( $id){

        $oid= Hashids::connection(Order::class)->decode($id) ?? [0];
        if(!$oid){
            abort(404);
        }

        $order = Order::onlyTrashed()->findOrFail($oid[0]);

        if (!$order->trashed()){

            notify()->error('Order isn\'t in trash');
           return redirect()->back();
        }

        $order->restore();
---
select * from `orders` where `orders`.`deleted_at` is not null and `orders`.`id` = 65133 limit 1
update `orders` set `deleted_at` = '', `orders`.`updated_at` = '2021-10-13 23:13:25' where `id` = 65133