app/Http/Controllers/Admin/ReceiptController.php

    public function create()
    {
        //auth()->user()->orders->where('status_id','>',4)->sortBy('status_id');
        $pendingOrders = auth()->user()->orders->where('status_id','=',1)->sortByDesc('id');
---
select * from `orders` where `orders`.`user_id` = 4 and `orders`.`user_id` is not null and `status_id` = 1 and `orders`.`deleted_at` is null order by `id` desc