app/Http/Controllers/Admin/ReceiptController.php

    public function index()
    {
        //
      //  $receipts = auth()->user()->receipts()->where('ready',0);
       $role =  auth()->user()->roles[0]->name;
     //  dd($role);
        $receipts = auth()->user()->receipts()->with('user')->get();
---
select * from `receipts` where `receipts`.`user_id` = 4 and `receipts`.`user_id` is not null and `receipts`.`deleted_at` is null

    public function create()
    {
        //auth()->user()->orders->where('status_id','>',4)->sortBy('status_id');
        $pendingOrders = auth()->user()->orders()->where('status_id','=',1)->with(['user'=> fn($q)=>$q->select('users.id','users.name'),
            'state'=> fn($q)=>$q->select('states.id','states.name'),
            'area'=> fn($q)=>$q->select('areas.id','areas.name'),
            'status'=> fn($q)=>$q->select('statuses.id','statuses.name'),
            ])->orderBy('id','desc')->get();
---
select `areas`.`id`, `areas`.`name` from `areas` where `areas`.`id` in (3, 20)
select `statuses`.`id`, `statuses`.`name` from `statuses` where `statuses`.`id` in (1)
select `users`.`id`, `users`.`name` from `users` where `users`.`id` in (4)