app/Http/Controllers/Admin/TaskController.php

    public function index()
    {
        //
        $tasks = Task::where('done_at','=',null)->with(array('user'=> function ($query) { $query->select('id','name');},'delivery'=> function ($query) { $query->select('id','name');}))->orderBy('updated_at','DESC')->paginate(10);
---
select `id`, `name` from `users` where `users`.`id` in (1, 5, 6, 9, 10, 11, 14, 19, 20)
select count(*) as aggregate from `tasks` where `done_at` is null and `tasks`.`deleted_at` is null

    public function archive()
    {
        //
        $tasks = Task::where('done_at','!=',null)->with(array('user'=> function ($query) { $query->select('id','name');},'delivery'=> function ($query) { $query->select('id','name');}))->orderBy('updated_at','DESC')->paginate(10);
---
select `id`, `name` from `users` where `users`.`id` in (6)
select count(*) as aggregate from `tasks` where `done_at` is not null and `tasks`.`deleted_at` is null

    public function trash(){
        $tasks = Task::onlyTrashed()->with(['user'=>fn($q)=>$q->select('id','name'),'delivery'=>fn($q)=>$q->select('id','name')])->paginate(25);
---
select * from `users` where `users`.`id` in (9, 10)
select count(*) as aggregate from `tasks` where `tasks`.`deleted_at` is not null

    public function done($id){
       $task =  Task::findOrFail($id);
    //   dd($task);
       $task->done_at = now();
       $task->update();
---
update `tasks` set `done_at` = '2021-10-13 23:22:48', `tasks`.`updated_at` = '2021-10-13 23:22:48' where `id` = 9