app/Http/Controllers/Admin/UserController.php

    public function show(int $id)
    {
      //  $user = User::findOrFail($id);
      //  $userRole = DB::table('roles')->where('id',$user->role)->get();
       // $user = User::with('roles')->findOrFail($id);
        $user =  User::where('id',$id)->with(array('roles'=> function ($query) { $query->select('id','name');},'plan'=> function ($query) { $query->select('id','name');}))->first();
---
select `id`, `name` from `plans` where `plans`.`id` in (1)